In [58]:
import pandas as pd

# Series

In [59]:
data =[1,2,3,4,5]

In [60]:
s = pd.Series(data)

In [61]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [62]:
index = ['Linha' + str(i) for i in range(5)]

In [63]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [64]:
s = pd.Series(data = data, index = index)

In [65]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [66]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [67]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [68]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [69]:
s1 = s+2

In [70]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [71]:
s2 = s + s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## DataFrame

In [72]:
data = [[1,2,3],
        [4,5,6],
        [7,8,9]]

In [73]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [74]:
df1 = pd.DataFrame(data = data)

In [75]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [76]:
index = ['Linha' + str(i) for i in range(3)]

In [77]:
index

['Linha0', 'Linha1', 'Linha2']

In [78]:
df1 = pd.DataFrame(data = data, index = index)

In [79]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [80]:
columns = ['columns' + str(i) for i in range(3)]
columns

['columns0', 'columns1', 'columns2']

In [81]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [82]:
df1

        columns0  columns1  columns2
Linha0         1         2         3
Linha1         4         5         6
Linha2         7         8         9

In [83]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [84]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [85]:
df2 = pd.DataFrame(data)

In [86]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [87]:
data = [(1,2,3),
        (4,5,6),
        (7,8,9)]

In [88]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [89]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        columns0  columns1  columns2
Linha0         1         2         3
Linha1         4         5         6
Linha2         7         8         9

In [90]:
df2[df2 > 0] = 'B'
df2

C:\Users\z486958\AppData\Local\Temp\ipykernel_11408\416000018.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'B' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df2[df2 > 0] = 'B'

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [91]:
df3[df3 > 0] = 'C'
df3

C:\Users\z486958\AppData\Local\Temp\ipykernel_11408\2590307496.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'C' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df3[df3 > 0] = 'C'

       columns0 columns1 columns2
Linha0        C        C        C
Linha1        C        C        C
Linha2        C        C        C

In [92]:
df4 = pd.concat([df1, df2, df3])
df4

       columns0 columns1 columns2 Coluna0 Coluna1 Coluna2
Linha0        1        2        3     NaN     NaN     NaN
Linha1        4        5        6     NaN     NaN     NaN
Linha2        7        8        9     NaN     NaN     NaN
Linha0      NaN      NaN      NaN       B       B       B
Linha1      NaN      NaN      NaN       B       B       B
Linha2      NaN      NaN      NaN       B       B       B
Linha0        C        C        C     NaN     NaN     NaN
Linha1        C        C        C     NaN     NaN     NaN
Linha2        C        C        C     NaN     NaN     NaN

In [93]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

,columns0,columns1,columns2,Coluna0,Coluna1,Coluna2,columns0,columns1,columns2
Linha0,1,2,3,B,B,B,C,C,C
Linha1,4,5,6,B,B,B,C,C,C
Linha2,7,8,9,B,B,B,C,C,C